"""
Дан список
['samsung', 'lg', 'xerox', 'bosch']
Удалить элемент с именем 'xerox'
Добавить элемент на 2 место 'indesit'
"""

LI_LI = ["samsung", "lg", "xerox", "bosch"]
LI_LI.remove("xerox")
LI_LI.insert(1, "indesit")
print(LI_LI)
